from telegram import Update
from telegram.ext import Application, ContextTypes



#* Telegram bot framework ________________________________________________________________________

#* Core ________________________________________________________________________

#* Other packages ________________________________________________________________________


class BaseMessages:
    # * TEXT ___________________________________________________________________
    help_text = (
        "/start - Запуск бота\n"
        "/help - Помощь\n"
        "/schedule - Расписание группы\n"
        "/set_group - Установить группу\n"
        "/settings - Настройки бота\n"
    )

    # * TEMPLATES ___________________________________________________________________



# * MODULE ___________________________________________________________________

class BaseModule:
    def __init__(self) -> None:
        pass

    def setup(self, application: 'Application') -> None:
        raise Exception('Функция не переопределена')
    

    # * ____________________________________________________________
    # * |               Command handlers                            |
    # ...

    #? /some_command - some command
    def some_command(self, update: 'Update', context: 'ContextTypes.DEFAULT_TYPE') -> None:
        return 
    # * |___________________________________________________________|



    # * ____________________________________________________________
    # * |               Message handlers                            |
    # ...
    # * |___________________________________________________________|


    # * ____________________________________________________________
    # * |               Callback handlers                            |
    # ...
    # * |___________________________________________________________|