GROUP_IDS = {
    # 4: {  # Курс 4
    #     "4Б09 РПС-41": "",
    # },
    # 3: {  # Курс 3
    #     "4Б09 РПС-32": "",
    # },

    "ИМЕиКН": {
        2: {  # Курс 2
            "4Б09 РПС-21": "231",
            "4Б09 ООС-21": "204",
        },
    },

    "ИМЕИТ": {
        2: {
            "5Б13 ЦТ-21": "629",
        }
    }

    # 1: {  # Курс 1
    #     "4Б09 РПС-11": "",
    # },
}

SUBGROUP_IDS = {
    "Первая подгруппа": 1,
    "Вторая подгруппа": 2,
    "Третья подгруппа": 3,
    "Четвертая подгруппа": 4,
}